Repository: j-tap/wc-token-payments
Catalog: languages/wc-token-payments-*.po
Languages: es_es, ru_ru

source: WC Token Payments requires WooCommerce to be installed and active.
es_es: WC Token Payments requiere WooCommerce instalado y activo.
ru_ru: Для работы WC Token Payments нужен установленный и активный WooCommerce.

source: Token Balance
es_es: Saldo de tokens
ru_ru: Баланс токенов

source: No operations yet.
es_es: Aún no hay operaciones.
ru_ru: Операций пока нет.

source: Date
es_es: Fecha
ru_ru: Дата

source: Kind
es_es: Tipo
ru_ru: Тип

source: Tokens
ru_ru: Токены

source: Order
es_es: Pedido
ru_ru: Заказ

source: Note
es_es: Nota
ru_ru: Примечание

source: You must be logged in to view token balance.
es_es: Inicia sesión para ver tu saldo de tokens.
ru_ru: Войдите, чтобы увидеть баланс токенов.

source: Token balance:
es_es: Saldo de tokens:
ru_ru: Баланс токенов:

source: Token Payments
es_es: Pago con tokens
ru_ru: Платёж токенами

source: Balance updated.
es_es: Saldo actualizado.
ru_ru: Баланс обновлён.

source: Error:
ru_ru: Ошибка:

source: Configure the token rate and manage balances.
es_es: Configura el tipo de cambio de tokens y gestiona los saldos.
ru_ru: Настройка курса токенов и управление балансами.

source: Settings
es_es: Ajustes
ru_ru: Настройки

source: Token rate and top-up product.
es_es: Tipo de tokens y producto de recarga.
ru_ru: Курс токенов и товар пополнения.

source: Add or subtract tokens for a user.
es_es: Añadir o restar tokens a un usuario.
ru_ru: Добавить или списать токены пользователю.

source: Optional note
es_es: Nota opcional
ru_ru: Необязательная заметка

source: Tokens per 1 %s
es_es: Tokens por 1 %s
ru_ru: Токенов за 1 %s

source: tokens
ru_ru: токенов

source: Top-up product ID
es_es: ID del producto de recarga
ru_ru: ID товара пополнения

source: Auto-created on activation. Keep this stable.
es_es: Se crea al activar. Mantén este valor estable.
ru_ru: Создаётся при активации. Не меняйте без необходимости.

source: Top-up payment page
es_es: Página de pago de recarga
ru_ru: Страница оплаты пополнения

source: Leave empty to use the default WooCommerce checkout (%s). Customer is redirected here to enter billing details, select payment method and pay.
es_es: Deja vacío para usar el checkout de WooCommerce (%s). El cliente será redirigido aquí para introducir datos, seleccionar método de pago y pagar.
ru_ru: Оставьте пустым для использования страницы оформления WooCommerce (%s). Покупатель будет перенаправлен сюда для ввода данных, выбора способа оплаты и оплаты.

source: Could not add top-up to cart.
es_es: No se pudo añadir la recarga al carrito.
ru_ru: Не удалось добавить пополнение в корзину.

source: Save Settings
es_es: Guardar ajustes
ru_ru: Сохранить настройки

source: Manual balance adjustment
es_es: Ajuste manual del saldo
ru_ru: Ручная корректировка баланса

source: User ID
es_es: ID de usuario
ru_ru: ID пользователя

source: Delta tokens (+/-)
es_es: Cambio de tokens (+/-)
ru_ru: Изменение токенов (+/-)

source: Apply
es_es: Aplicar
ru_ru: Применить

source: Pay with Tokens
es_es: Pagar con tokens
ru_ru: Оплата токенами

source: Pay using token balance.
es_es: Pagar con el saldo de tokens.
ru_ru: Оплата с баланса токенов.

source: Enable/Disable
es_es: Activar/Desactivar
ru_ru: Включить/выключить

source: Enable token payments
es_es: Activar pago con tokens
ru_ru: Включить оплату токенами

source: Title
es_es: Título
ru_ru: Название

source: You must be logged in to pay with tokens.
es_es: Inicia sesión para pagar con tokens.
ru_ru: Войдите, чтобы оплатить токенами.

source: Top-up orders cannot be paid with tokens.
es_es: Los pedidos de recarga no se pueden pagar con tokens.
ru_ru: Заказы на пополнение нельзя оплатить токенами.

source: Invalid token calculation.
es_es: Cálculo de tokens no válido.
ru_ru: Некорректный расчёт токенов.

source: Not enough tokens. Need %1$d, you have %2$d.
es_es: Tokens insuficientes. Necesitas %1$d, tienes %2$d.
ru_ru: Недостаточно токенов. Нужно %1$d, у вас %2$d.

source: Payment in progress, please try again.
es_es: Pago en curso, inténtalo de nuevo.
ru_ru: Оплата выполняется, попробуйте позже.

source: Paid with tokens
es_es: Pagado con tokens
ru_ru: Оплачено токенами

source: Token payment failed: %s
es_es: El pago con tokens ha fallado: %s
ru_ru: Оплата токенами не удалась: %s

source: You must be logged in to buy tokens.
es_es: Inicia sesión para comprar tokens.
ru_ru: Войдите, чтобы купить токены.

source: Amount in %s:
es_es: Importe en %s:
ru_ru: Сумма в %s:

source: You will receive:
es_es: Recibirás:
ru_ru: Вы получите:

source: Proceed to payment
es_es: Proceder al pago
ru_ru: Перейти к оплате

source: Invalid amount.
es_es: Importe no válido.
ru_ru: Некорректная сумма.

source: Amount is too low to receive at least 1 token.
es_es: El importe es demasiado bajo para recibir al menos 1 token.
ru_ru: Сумма слишком мала для получения хотя бы 1 токена.

source: Invalid user or token quantity.
es_es: Usuario o cantidad de tokens no válidos.
ru_ru: Некорректный пользователь или количество токенов.

source: Top-up product not found.
es_es: Producto de recarga no encontrado.
ru_ru: Товар пополнения не найден.

source: Security check failed. Please try again.
es_es: Comprobación de seguridad fallida. Inténtalo de nuevo.
ru_ru: Проверка безопасности не пройдена. Попробуйте снова.

source: Token top-up
es_es: Recarga de tokens
ru_ru: Пополнение токенов

source: Tokens needed for this order: %d
es_es: Tokens necesarios para este pedido: %d
ru_ru: Нужно токенов для этого заказа: %d

source: Token top-up via Woo order
es_es: Recarga de tokens mediante pedido WooCommerce
ru_ru: Пополнение токенов через заказ WooCommerce

source: Processing...
es_es: Procesando...
ru_ru: Обработка...

source: Checkout form not found.
es_es: Formulario de pago no encontrado.
ru_ru: Форма оформления заказа не найдена.

source: Order #%1$s paid successfully with %2$d tokens.
es_es: Pedido #%1$s pagado con éxito con %2$d tokens.
ru_ru: Заказ #%1$s успешно оплачен токенами: %2$d.

source: Thank you page (token payment)
es_es: Página de agradecimiento (pago con tokens)
ru_ru: Страница благодарности (оплата токенами)

source: Redirect after successful payment with tokens. Use the same URL as your main payment method (e.g. /thanks/). You can use {order_id} in the URL.
es_es: Redirigir tras el pago con tokens. Use la misma URL que su método de pago principal (ej. /thanks/). Puede usar {order_id} en la URL.
ru_ru: Куда перенаправлять после успешной оплаты токенами. Укажите тот же URL, что и для обычной оплаты (например /thanks/). В URL можно использовать {order_id}.

source: Path (e.g. /checkout/) or full URL. Leave empty to use the default WooCommerce checkout. Customer is redirected here to enter billing details and pay.
es_es: Ruta (ej. /checkout/) o URL completa. Deje vacío para usar la página de pago por defecto. El cliente se redirige aquí para introducir datos y pagar.
ru_ru: Путь (например /checkout/) или полный URL. Оставьте пустым для страницы оформления по умолчанию. Сюда перенаправляют для ввода данных и оплаты.

source: Path (e.g. /thanks/?status=successful) or full URL. Same page as after normal payment. You can use {order_id} in the path.
es_es: Ruta (ej. /thanks/?status=successful) o URL completa. La misma página que tras el pago normal. Puede usar {order_id} en la ruta.
ru_ru: Путь (например /thanks/?status=successful) или полный URL. Та же страница, что и после обычной оплаты. В пути можно использовать {order_id}.

source: Top up
es_es: Recargar
ru_ru: Пополнить

source: Top-up page (insufficient balance)
es_es: Página de recarga (saldo insuficiente)
ru_ru: Страница пополнения (при недостатке токенов)

source: Path or full URL for the "Top up" button when the customer does not have enough tokens on checkout.
es_es: Ruta o URL completa del botón «Recargar» cuando el cliente no tiene suficientes tokens en el checkout.
ru_ru: Путь или URL для кнопки «Пополнить», когда на оформлении заказа у покупателя недостаточно токенов.
